{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "blink.download": {
      "src": "https://github.com/Saghen/blink.download"
    },
    "blink.pairs": {
      "src": "https://github.com/Saghen/blink.pairs",
      "version": "0.0.0 - 1.0.0"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "claudecode.nvim": {
      "src": "https://github.com/coder/claudecode.nvim",
      "version": "0.0.0 - 1.0.0"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "inc-rename.nvim": {
      "src": "https://github.com/smjonas/inc-rename.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/hoob3rt/lualine.nvim"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons",
      "version": ">=0.0.0"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/kyazdani42/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim",
      "version": "8.0.0 - 9.0.0"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim",
      "version": "8.0.0 - 9.0.0"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "telescope-ui-select.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-ui-select.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim",
      "version": ">=0.0.0"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "vim-crates": {
      "src": "https://github.com/mhinz/vim-crates"
    },
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    }
  }
}
